"""
Программа помощник для изучения азбуки морзе
"""


def morse_encode(word):
    """Перевод слова в код морзе"""
    cods_dictionary = {
        "0": "-----", "1": ".----", "2": "..---", "3": "...--", "4": "....-",
        "5": ".....", "6": "-....", "7": "--...", "8": "---..", "9": "----.", "a": ".-",
        "b": "-...", "c": "-.-.", "d": "-..", "e": ".", "f": "..-.", "g": "--.",
        "h": "....", "i": "..", "j": ".---", "k": "-.-", "l": ".-..", "m": "--",
        "n": "-.", "o": "---", "p": ".--.", "q": "--.-", "r": ".-.", "s": "...",
        "t": "-", "u": "..-", "v": "...-", "w": ".--", "x": "-..-", "y": "-.--",
        "z": "--..", ".": ".-.-.-", ",": "--..--", "?": "..--..", "!": "-.-.--",
        "-": "-....-", "/": "-..-.", "@": ".--.-.", "(": "-.--.", ")": "-.--.-"
    }

    encoded = []

    for char in word:
        if char in cods_dictionary:
            encoded.append(cods_dictionary[char])

    return ' '.join(encoded)


print(morse_encode("test"))
